{
  "cycle": 5,
  "baseline": {
    "games": 200,
    "playerWins": 102,
    "enemyWins": 98,
    "draws": 0,
    "note": "200-game confirmed baseline (from cycle 2 analysis verbose run). True expected rate ~50% for identical AIs. Original 50-game run gave 35/50 (70%) which was a variance artifact.",
    "oscillations_per_game": 1.9,
    "collapses_per_game": 1.6,
    "fires_per_game": 3.1
  },
  "current": {
    "games": 200,
    "playerWins": 102,
    "enemyWins": 98,
    "draws": 0,
    "note": "200-game confirmed baseline (from cycle 2 analysis verbose run). True expected rate ~50% for identical AIs. Original 50-game run gave 35/50 (70%) which was a variance artifact.",
    "oscillations_per_game": 1.9,
    "collapses_per_game": 1.6,
    "fires_per_game": 3.1
  },
  "history": [
    {
      "cycle": 1,
      "problem": "Score collapses cause defensive paralysis — DANGER_ZONE_FACTOR=3 creates 9x collision area danger zone, overwhelming strategic signals",
      "fix": "Reduced DANGER_ZONE_FACTOR from 3 to 2, shrinking danger zone area by 56% (9x to 4x collision area)",
      "result": "ROLLBACK",
      "metrics": { "playerWins": 23, "enemyWins": 27, "draws": 0, "oscillations": 159, "collapses": 83 },
      "reason": "Player wins dropped from 35 to 23 (34% regression). Although collapses fell 33% and fires increased 66%, the tighter danger zone caused more asteroid deaths — the player navigated closer to asteroids and died more frequently. Net combat gain did not compensate for increased asteroid mortality."
    },
    {
      "cycle": 2,
      "problem": "Fire-opportunity signal overwhelmed by danger-zone penalties — FIRE_OPPORTUNITY_BONUS=300 (max ~1800 at mid-range) beaten by proximity penalties (-2978 at proximity 0.386), causing AI to prefer evasion over aim-holding even when a shot is available",
      "fix": "Increased FIRE_OPPORTUNITY_BONUS from 300 to 600, raising max fire signal to ~3600 at mid-range",
      "result": "ROLLBACK",
      "metrics": { "playerWins": 24, "enemyWins": 26, "draws": 0, "oscillations": 113, "collapses": 66 },
      "reason": "Player wins 24/50 fell below baseline threshold of 35. Collapses improved significantly (66 vs 124, -47%) and fires slightly increased (132 vs 118). However, the 50-game win count (24) was below the hard threshold (35). Note: the 35 baseline is itself a positive 50-game variance artifact (true ~50%); the true signal of this change remains unclear without a 200-game run. Rolled back per hard threshold rule."
    },
    {
      "cycle": 3,
      "problem": "Oscillation during near-collapse — score gap between best and second-best actions (~285 pts) exceeds HYSTERESIS_BONUS=250, causing the AI to flip actions on every hold-timer boundary in high-speed approach scenarios",
      "fix": "Increased HYSTERESIS_BONUS from 250 to 500, bridging the ~285-point gap so the previous braking action is held stable",
      "result": "ROLLBACK",
      "metrics": { "playerWins": 24, "enemyWins": 26, "draws": 0, "oscillations": 171, "collapses": 100 },
      "reason": "Player wins 24/50 fell below baseline threshold of 35. Worse: oscillations INCREASED 75% (98→171) and action changes increased 71% (276→472), opposite of the intended effect. The higher hysteresis stabilizes some actions but makes the AI slower to adapt when the optimal action genuinely changes, creating larger commitment errors. Fires did increase significantly (118→206, +75%), suggesting more engagement — but these didn't convert to wins. The win rate signal is still within 50-game variance noise, but the oscillation regression is a genuine behavioral failure."
    },
    {
      "cycle": 4,
      "problem": "Fire-opportunity signal overwhelmed by danger-zone penalties — FIRE_OPPORTUNITY_BONUS=300 overwhelmed at moderate proximity, causing AI to prefer evasion over aim-holding. Attempting 3x increase to overcome the balance point.",
      "fix": "Increased FIRE_OPPORTUNITY_BONUS from 300 to 900, raising max fire signal to ~5400 at mid-range (exceeds -5000 danger penalty at proximity 0.5)",
      "result": "ROLLBACK",
      "metrics": {
        "playerWins": 96,
        "enemyWins": 104,
        "draws": 0,
        "oscillations_per_game": 2.7,
        "collapses_per_game": 1.7,
        "fires_per_game": 2.7,
        "action_changes_per_game": 7.2
      },
      "reason": "Player wins 96/200 fell below the 100-win threshold (48% vs 51% baseline). Oscillations increased 42% (2.7 vs 1.9 per game), exceeding the 15% secondary metric degradation limit. Fires decreased from 3.1 to 2.7/game (-13%), suggesting the higher fire bonus causes aim-holding into asteroid proximity, reducing effective firing opportunities rather than increasing them. The tripling of FOB appears to overcorrect — the AI now holds aim too aggressively in situations where evasion would have been better, likely leading to more asteroid deaths or unstable trajectories. FIRE_OPPORTUNITY_BONUS tuning is exhausted at 300→600 (too small, Cycle 2) and 300→900 (too large, Cycle 4). The 300→600 change (Cycle 2) showed favorable secondary metrics (47% collapse reduction) but was rolled back due to 50-game variance noise — a 200-game re-test of FOB=600 might be warranted, but it was already validated at 105/200 (52.5%) which is within variance noise of 50%."
    },
    {
      "cycle": 5,
      "problem": "Danger-zone penalty depth overwhelms strategic signals — COLLISION_BASE_PENALTY=-20000 produces near-miss penalties up to -20000, dwarfing fire signal (~1800) and aim bonus (~1200). Attempting to halve penalty depth.",
      "fix": "Reduced COLLISION_BASE_PENALTY from -20000 to -10000, halving the penalty depth for both near-misses and actual collisions",
      "result": "ROLLBACK",
      "metrics": {
        "playerWins": null,
        "enemyWins": null,
        "draws": null,
        "note": "Rolled back before simulation — blocked by failing tests"
      },
      "reason": "ROLLBACK at test phase. Halving COLLISION_BASE_PENALTY from -20000 to -10000 broke the existing 'avoids asteroid when a clear path exists' test: with the halved penalty, T___ (thrust-straight into asteroid) scored -4131.8 while TL__ (turn-left to dodge) scored -9215.5, causing the AI to prefer crashing into the asteroid over evading it. Root cause: COLLISION_BASE_PENALTY controls both (a) actual collision score and (b) near-miss danger zone penalty. Halving the base affects both. With -10000, the collision penalty (-10000 + early_bonus + all_strategic_signals) is no longer sufficient to deter choosing trajectories that actually collide when the target is directly behind the asteroid. Lesson: COLLISION_BASE_PENALTY is a unified constant — it cannot be halved for 'near-miss penalty reduction' without also halving the 'actual collision deterrence'. These two effects cannot be separated without refactoring scoreTrajectory to use distinct constants for each case."
    }
  ],
  "consecutiveRollbacks": 5,
  "status": "ready"
}
